pipe/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       15918;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       15958;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          404;
        startFace       15998;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16160;
        startFace       16402;
    }
)

// ************************************************************************* //
